app/controllers/user_sessions_controller.rb

  def create
    omniauth = env['omniauth.auth']
    logger.debug "+++ #{omniauth}"

    user = User.find_by_uid(omniauth['uid'])
    if not user
      # New user registration
      user = User.new(:uid => omniauth['uid'])
    end
    user.first_name = omniauth['extra']['first_name']
    user.last_name  = omniauth['extra']['last_name']
    user.save
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '4' LIMIT 1
INSERT INTO "users" ("created_at", "first_name", "last_name", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 08 Apr 2013 10:38:45 UTC +00:00], ["first_name", "Admin"], ["last_name", "Admin"], ["uid", "4"], ["updated_at", Mon, 08 Apr 2013 10:38:45 UTC +00:00]]